Examinator/src/InformationRegisters/НастройкиПрохожденияЭлектронныхРесурсовСУЗ/НастройкиПрохожденияЭлектронныхРесурсовСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПрохожденияЭлектронныхРесурсовСУЗ</name>
  <attributes>
    <name>ПоследнийЭлементСодержания</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьСодержание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиЭлектронногоРесурса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрохождениеОбучения</name>
    <type>
      <types>DefinedType.ПрохождениеЭлектронногоОбучения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задание</name>
    <type>
      <types>DefinedType.ЗаданиеЭлектронногоОбучения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/НастройкиПользователейСУО/НастройкиПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователейСУО</name>
  <attributes>
    <name>СкрытьКонтактнуюИнформацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СкрытьДополнительныеСведения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРассылкуНаАдресЭлектроннойПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьУведомленияОНовыхЛичныхСообщениях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьУведомленияОНовыхСообщенияхФорума</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/УчебныеБазыСУЗ/УчебныеБазыСУЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчебныеБазыСУЗ</name>
  <attributes>
    <name>СпособПодключения</name>
    <type>
      <types>EnumRef.СпособыПодключенияКВнешнейИнформационнойБазеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>АутентификацияWindowsИнформационнойБазы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИнформационнойБазыНаСервере</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСервераИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КаталогИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПарольИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательИнформационнойБазы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресНаВебСервере</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.ПрограммныеПродуктыСУЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/CommonForms/ПерсональныеНастройкиСУО/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УдалитьПерсональныеНастройкиЭлектронныхРесурсовНаСервере()
	
	НаборЗаписей = РегистрыСведений.НастройкиПрохожденияЭлектронныхРесурсовСУЗ.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Пользователь.Установить(АвторизованныйПользователь);
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Функция ВыполнитьОчисткуКаталогаВременныхФайлов() 
	
	ПутьККаталогу = ОбъектыСУЗПовтИсп.ПутьКаталогуОбъектов();
	
	Если ЗначениеЗаполнено(ПутьККаталогу) Тогда
		
		Попытка
		    УдалитьФайлы(ПутьККаталогу);  
		Исключение
		    Возврат ОписаниеОшибки();
		КонецПопытки;

	КонецЕсли
		
КонецФункции

//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

&НаСервереБезКонтекста
Процедура ЗаписатьНастройкуСУО(ИмяНастройки, ЗначениеНастройки)
	
	РегистрыСведений.НастройкиПользователейСУО.ЗаписатьНастройку(Пользователи.ТекущийПользователь(), ИмяНастройки, ЗначениеНастройки);	
	
КонецПроцедуры

//----------------------------------//

&НаСервере
Процедура ЗаписатьНастройкиНаСервере()
		
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(
		"НастройкиПрограммы/ПредлагатьУстановкуРасширенияРаботыСФайлами",
		ИдентификаторКлиента,
		НапоминатьОбУстановкеРасширенияРаботыСФайлами);
		
	СохранитьСвойстваКоллекции("ОбщиеНастройкиПользователя", ЭтотОбъект,
		"ЗапрашиватьПодтверждениеПриЗавершенииПрограммы");		
		
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

&НаСервере
Процедура СохранитьСвойстваКоллекции(КлючОбъекта, Коллекция, ИменаРеквизитов)
	СтруктураРеквизитов = Новый Структура(ИменаРеквизитов);
	ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Коллекция);
	Для Каждого КлючИЗначение Из СтруктураРеквизитов Цикл
		ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получаем переменные
	
	АвторизованныйПользователь = Пользователи.АвторизованныйПользователь();
	
	ЗапрашиватьПодтверждениеПриЗавершенииПрограммы = СтандартныеПодсистемыСервер.ЗапрашиватьПодтверждениеПриЗавершенииПрограммы();
	
	//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//
	
	НастройкиПользователяИзБД = Неопределено;
	
	РегистрыСведений.НастройкиПользователейСУО.ЗаполнитьСтруктуруНастроек(Пользователи.ТекущийПользователь(), НастройкиПользователяИзБД);
	
	Если НастройкиПользователяИзБД <> Неопределено Тогда
	
		ЗапретитьРассылкуНаАдресЭлектроннойПочты = НастройкиПользователяИзБД.ЗапретитьРассылкуНаАдресЭлектроннойПочты;
		СкрытьКонтактнуюИнформацию = НастройкиПользователяИзБД.СкрытьКонтактнуюИнформацию;
		СкрытьДополнительныеСведения = НастройкиПользователяИзБД.СкрытьДополнительныеСведения;
		ЗапретитьУведомленияОНовыхЛичныхСообщениях = НастройкиПользователяИзБД.ЗапретитьУведомленияОНовыхЛичныхСообщениях;
		ЗапретитьУведомленияОНовыхСообщенияхФорума = НастройкиПользователяИзБД.ЗапретитьУведомленияОНовыхСообщенияхФорума;
		
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ПолныйИнтерфейсСУО") Тогда
		Элементы.ОбщаяКомандаМоиПинКодыСУО.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.СкрытьДополнительныеСведения.Видимость = ПолучитьФункциональнуюОпцию("ИспользоватьДополнительныеРеквизитыИСведения");
	
	//----------------------------------//
	
	ИспользуетсяЛокальныйКэшНаКлиенте = ПараметрыСеанса.ИспользуетсяЛокальныйКэшНаКлиентеСУЗ;
	
	ЭтоВебКлиент = ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент();
	
	// Устанавливаем видимость элементов
	
	Элементы.ГруппаВебКлиент.Видимость = ЭтоВебКлиент;
	Элементы.ОчиститьКаталогВременныхФайлов.Видимость = ИспользуетсяЛокальныйКэшНаКлиенте;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	#Если ВебКлиент Тогда	
	НапоминатьОбУстановкеРасширенияРаботыСФайлами = ОбщегоНазначенияКлиент.ПредлагатьУстановкуРасширенияРаботыСФайлами();
	#КонецЕсли	

	СистемнаяИнформация = Новый СистемнаяИнформация;
	ИдентификаторКлиента = СистемнаяИнформация.ИдентификаторКлиента;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД

&НаКлиенте
Процедура ОбновитьПараметрыСистемы(Команда)
	ОбновитьПовторноИспользуемыеЗначения();
	ОбновитьИнтерфейс();
	ПоказатьПредупреждение(,НСтр("ru = 'Параметры системы обновлены'"));
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКаталогВременныхФайлов(Команда)
	
	#Если НЕ ВебКлиент Тогда
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ОчиститьКаталогВременныхФайловПродолжение", ЭтотОбъект);		
		
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'После удаления временных файлов программа будет перезапущена. Продолжить?'"), РежимДиалогаВопрос.ДаНет, 0);
		
	#КонецЕсли	
	
КонецПроцедуры

#Если НЕ ВебКлиент Тогда

&НаКлиенте
Процедура ОчиститьКаталогВременныхФайловПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;

	СообщениеОбОшибке = ВыполнитьОчисткуКаталогаВременныхФайлов();
	
	Если СообщениеОбОшибке <> Неопределено Тогда
		
		ПоказатьПредупреждение(,НСтр("ru = 'В процессе удаления файлов произошла ошибка. Рекомендуется закрыть все используемые файлы и после перезапуска выполнить очистку повторно. Описание ошибки: '") + СообщениеОбОшибке);
		
	Иначе
		
		ЗавершитьРаботуСистемы(Ложь, Истина);

	КонецЕсли;

КонецПроцедуры	

#КонецЕсли

&НаКлиенте
Процедура ПерсональнаяНастройкаПроксиСервера(Команда)
	
	ОткрытьФорму("ОбщаяФорма.ПараметрыПроксиСервера",
				Новый Структура("НастройкаПроксиНаКлиенте", Истина));

КонецПроцедуры

&НаКлиенте
Процедура СведенияОПользователе(Команда)
	ПоказатьЗначение(,АвторизованныйПользователь);
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПерсональныеНастройкиЭлектронныхРесурсов(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("УдалитьПерсональныеНастройкиЭлектронныхРесурсовПродолжение", ЭтотОбъект);		
		
	ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Удалить настройки?'"), РежимДиалогаВопрос.ДаНет, 0);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПерсональныеНастройкиЭлектронныхРесурсовПродолжение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
	    Возврат;
	КонецЕсли;

	УдалитьПерсональныеНастройкиЭлектронныхРесурсовНаСервере();
	
	ПоказатьПредупреждение(,НСтр("ru = 'Настройки успешно удалены'"));	
	
КонецПроцедуры	

&НаКлиенте
Процедура УстановитьРасширениеРаботыСФайламиНаКлиенте(Команда)
	НачатьУстановкуРасширенияРаботыСФайлами();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьПароль(Команда)
	ОткрытьФорму("ОбщаяФорма.ИзменениеПароляПользователяИБ",,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура УчебныеБазы(Команда)
	ОткрытьФорму("РегистрСведений.УчебныеБазыСУЗ.Форма.ФормаПерсональныеУчебныеБазы");
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура НапоминатьОбУстановкеРасширенияРаботыСФайламиПриИзменении(Элемент)
	
	ЗаписатьНастройкиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапрашиватьПодтверждениеПриЗавершенииПрограммыПриИзменении(Элемент)
		
	ЗаписатьНастройкиНаСервере();
	
КонецПроцедуры

//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

&НаКлиенте
Процедура СкрытьКонтактнуюИнформациюПриИзменении(Элемент)
	ЗаписатьНастройкуСУО("СкрытьКонтактнуюИнформацию", СкрытьКонтактнуюИнформацию);
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьРассылкуНаАдресЭлектроннойПочтыПриИзменении(Элемент)
	ЗаписатьНастройкуСУО("ЗапретитьРассылкуНаАдресЭлектроннойПочты", ЗапретитьРассылкуНаАдресЭлектроннойПочты);
КонецПроцедуры

&НаКлиенте
Процедура СкрытьДополнительныеСведенияПриИзменении(Элемент)
	ЗаписатьНастройкуСУО("СкрытьДополнительныеСведения", СкрытьДополнительныеСведения);
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьУведомленияОНовыхСообщенияхФорумаПриИзменении(Элемент)
	ЗаписатьНастройкуСУО("ЗапретитьУведомленияОНовыхСообщенияхФорума", ЗапретитьУведомленияОНовыхСообщенияхФорума);
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьУведомленияОНовыхЛичныхСообщенияхПриИзменении(Элемент)
	ЗаписатьНастройкуСУО("ЗапретитьУведомленияОНовыхЛичныхСообщениях", ЗапретитьУведомленияОНовыхЛичныхСообщениях);
КонецПроцедуры

//----------------------------------//

//--# КОНСТРУКТОР КУРСОВ УДАЛИТЬ #--//

// Реквизиты:
// - ЗапретитьРассылкуНаАдресЭлектроннойПочты
// - СкрытьКонтактнуюИнформацию
// - СкрытьДополнительныеСведения
// - ЗапретитьУведомленияОНовыхСообщенияхФорума
// - ЗапретитьУведомленияОНовыхЛичныхСообщениях
// Команды:
// - МоиПинКоды

//----------------------------------//
